Saturday-Vinyl/saturday-vinyl-supabase/sdkconfig.defaults
# Saturday Vinyl Hub - SDK Configuration Defaults
# These settings are applied when the project is first configured
# or when sdkconfig is deleted.

# Target: ESP32-C6
CONFIG_IDF_TARGET="esp32c6"

# Project name
CONFIG_ESPTOOLPY_MONITOR_BAUD=115200

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Flash configuration (4MB flash typical)
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# FreeRTOS configuration
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=3072

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# Enable heap tracing for debugging (can disable in production)
CONFIG_HEAP_TRACING_OFF=y

# Wi-Fi configuration
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_TX_BUFFER_TYPE=1
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=32

# Networking
CONFIG_LWIP_LOCAL_HOSTNAME="saturday-hub"
CONFIG_LWIP_IPV6_NUM_ADDRESSES=12
CONFIG_LWIP_NETIF_STATUS_CALLBACK=y

# HTTP/HTTPS client (Phase 4)
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=y
CONFIG_ESP_HTTP_CLIENT_ENABLE_BASIC_AUTH=y

# TLS certificate bundle for HTTPS (Phase 4)
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# Bluetooth (for BLE provisioning - Phase 7)
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_NVS_PERSIST=y
CONFIG_BT_NIMBLE_SM_LEGACY=y
CONFIG_BT_NIMBLE_SM_SC=y
CONFIG_BT_NIMBLE_SVC_GAP_DEVICE_NAME="Saturday Hub"
CONFIG_BT_NIMBLE_GAP_DEVICE_NAME_MAX_LEN=32

# OpenThread (for Thread Border Router) - Phase 8
CONFIG_OPENTHREAD_ENABLED=y
CONFIG_OPENTHREAD_BORDER_ROUTER=y
CONFIG_OPENTHREAD_RADIO_NATIVE=y

# Thread Border Router specific settings
CONFIG_OPENTHREAD_BR_AUTO_START=n
CONFIG_OPENTHREAD_DNS64_CLIENT=y
CONFIG_OPENTHREAD_SRP_CLIENT=y

# Disable OpenThread CLI - conflicts with serial provisioning on USB Serial JTAG
CONFIG_OPENTHREAD_CLI=n
CONFIG_OPENTHREAD_CONSOLE_ENABLE=n

# Thread network defaults (overridden at runtime)
CONFIG_OPENTHREAD_NETWORK_NAME="SaturdayVinyl"
CONFIG_OPENTHREAD_NETWORK_CHANNEL=15
CONFIG_OPENTHREAD_NETWORK_PANID=0x5356

# mbedTLS configuration for Thread (DTLS) - keep enabled for future use
CONFIG_MBEDTLS_SSL_PROTO_DTLS=y
CONFIG_MBEDTLS_SSL_DTLS_HELLO_VERIFY=y
CONFIG_MBEDTLS_SSL_DTLS_SRTP=n
CONFIG_MBEDTLS_KEY_EXCHANGE_ECJPAKE=y
CONFIG_MBEDTLS_ECJPAKE_C=y

# OpenThread memory settings (requires OpenThread enabled)
# CONFIG_OPENTHREAD_NUM_MESSAGE_BUFFERS=65
# CONFIG_OPENTHREAD_SPINEL_RX_FRAME_BUFFER_SIZE=2048

# IEEE 802.15.4 radio settings for ESP32-C6 - keep enabled for future use
CONFIG_IEEE802154_ENABLED=y

# NVS encryption (optional, enable for production)
# CONFIG_NVS_ENCRYPTION=y

# Watchdog
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30

# UART for RFID module
CONFIG_UART_ISR_IN_IRAM=y

# Enable app rollback for OTA safety
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# Power management (disable for now, enable if battery operation needed)
CONFIG_PM_ENABLE=n

# Serial console - Use USB Serial/JTAG for ESP32-C6 DevKitC
# This enables stdin/stdout over the USB connection
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# VFS configuration for non-blocking stdin reads
CONFIG_VFS_SUPPORT_IO=y
CONFIG_VFS_SUPPORT_SELECT=y
